package com.example.almushaf;

public class AhadethNamesHolder {

    public static String []ArِAhadeth= {"الحديث الاول","الحديث الثاني","الحديث الثالث","الحديث الرابع","الحديث الخامس","الحديث السادس","الحديث السابع","الحديث الثامن","الحديث التاسع","الحديث العاشر ","الحديث الحادي عشر"
            ,"الحديث الثاني عشر","الحديث الثالث عشر","الحديث الرابع عشر","الحديث الخامس عشر ","الحديث السادس عشر","الحديث السابع عشر","الحديث الثامن عشر","الحديث التاسع عشر","الحديث العشرون","الحديث الحادي والعشرون","الحديث الثاني و العشرون","الحديث الثالث و العشرون"
            ,"الحديث الرابع و العشرون","الحديث الخامس و العشرون","الحديث السادس و العشرون","الحديث السابع و العشرون","الحديث الثامن و العشرون","الحديث التاسع و العشرون","الحديث الثلاثون","الحديث الحادي والثلاثون","الحديث الثاني و الثلاثون","الحديث الثالث والثلاثون","الحديث الرابع و الثلاثون"
            ,"الحديث الخامس و الثلاثون","الحديث السادس و الثلاثون","الحديث السابع و الثلاثون","الحديث الثامن و الثلاثون","الحديث التاسع و الثلاثون","الحديث الاربعون","الحديث الحادي و الاربعون","الحديث الثاني و الاربعون","الحديث الثالث والاربعون","الحديث الرابع و الاربعون","الحديث الخامس والاربعون","الحديث السادس و الاربعون"
            ,"الحديث السابع و الاربعون ","الحديث الثامن والاربعون","الحديث التاسع و الاربعون","الحديث الخمسون"};

}




